tutorials/incompressible/simpleFoam/ERCOFTAC_ConicalDiffuser/Case1.1_mixingPlane/0_orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];


internalField   uniform 100;

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 500;
    }

    outlet          
    {
        type            fixedValue;
        value           uniform 100;
    }

    wallProlongation
    {
        type            zeroGradient;
    }

    wallDiffuser
    {
        type            zeroGradient;
    }

    statSwirlWallB_C
    {
        type            zeroGradient;
    }

    rotSwirlWallA_BB
    {
        type            zeroGradient;
    }

    B_UPSTREAM
    {
        type            mixingPlane;
    }

    B_DOWNSTREAM
    {
        type            mixingPlane;
    }
}

// ************************************************************************* //
