tutorials/incompressible/simpleFoam/ERCOFTAC_ConicalDiffuser/Case1.1_mixingPlane/0_orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.0184;

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 2.0184;
    }

    outlet          
    {
        type            zeroGradient;
    }

    wallProlongation
    {
        type            zeroGradient;
    }

    wallDiffuser
    {
        type            zeroGradient;
    }

    statSwirlWallB_C
    {
        type            zeroGradient;
    }

    rotSwirlWallA_BB
    {
        type            zeroGradient;
    }

    B_UPSTREAM
    {
        type            mixingPlane;
    }

    B_DOWNSTREAM
    {
        type            mixingPlane;
    }
}

// ************************************************************************* //
